In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import sklearn
from sklearn.preprocessing import LabelEncoder
import os
import pyodbc

In [3]:
conexion = pyodbc.connect('Driver={SQL Server};'
'Server=DESKTOP-34T1EIQ;'
'Database=RepuestosWeb;'
'Trusted_Connection=yes;', timeout=5000)

In [7]:
df_Orders=pd.read_sql("select * from VW_CantidadCotizacionEncimaPromedio", conexion)
df_Orders.head(5)

   ID_Categoria       ID_Parte      Ciudad  TotalEncimaPromedio
0           220   *771RCUSTOM1     El Paso                    0
1          4786      ACK010564      Austin                    0
2           562   ABPKAR150150   Arlington                    0
3           254  AC1000172CORE  Fort Wayne                    0
4          2251      AC1043103       Akron                    0

In [9]:
dfParteEncima=pd.read_sql("select * from VW_CantidadPartesEncimaPromedio", conexion)
dfParteEncima.head(5)

,NombreCiudad,Genero,ID_Parte,ID_Categoria,TotalCantidadEncimaPromedio
0,San Diego,M,AC1100173CORE-ORIG.REC,1612,0
1,Tacoma,F,AC1320108-ORIG.REC,2827,0
2,Akron,M,AC1228119-ORIG.REC,3154,0
3,Richmond,M,AC1217107,3225,0
4,Dallas,F,AC2519105-ORIG.REC,4241,0

In [10]:
dfPorcentajeEncima=pd.read_sql("select * from VW_PorcentaEncimaPromedio", conexion)
dfPorcentajeEncima.head(5)

              ID_Parte  ID_Categoria     Nombre  TotalEncimaPromedio
0            AC1183100          1511    Spokane                    1
1           AC2502112N          1831   Colorado                    1
2            AC1200121          2080      Tulsa                    1
3            222ADJUST             6    Memphis                    0
4  AC1000148U-ORIG.REC          1235  Milwaukee                    1

In [11]:
dfOrdenesEncima=pd.read_sql("select * from VW_TotalOrdenesEncimaPromedio", conexion)
dfOrdenesEncima.head(5)

,NombreCiudad,Genero,ID_Parte,ID_Categoria,TotalEncimaPromedio
0,San Diego,M,AC1100173CORE-ORIG.REC,1612,1
1,Tacoma,F,AC1320108-ORIG.REC,2827,0
2,Akron,M,AC1228119-ORIG.REC,3154,0
3,Richmond,M,AC1217107,3225,1
4,Dallas,F,AC2519105-ORIG.REC,4241,0

In [12]:
dfOrdenCotizacionRealizada=pd.read_sql("select * from VW_OrdenRealizadaCotizacion", conexion)
dfOrdenesEncima.head(5)

,NombreCiudad,Genero,ID_Parte,ID_Categoria,TotalEncimaPromedio
0,San Diego,M,AC1100173CORE-ORIG.REC,1612,1
1,Tacoma,F,AC1320108-ORIG.REC,2827,0
2,Akron,M,AC1228119-ORIG.REC,3154,0
3,Richmond,M,AC1217107,3225,1
4,Dallas,F,AC2519105-ORIG.REC,4241,0

In [14]:
dfPorcentajeBajo=pd.read_sql("select * from VW_PorcentajeBajo", conexion)
dfPorcentajeBajo.head(5)

              ID_Parte  ID_Categoria     Nombre  PorcentajeBajo
0            AC1183100          1511    Spokane               0
1           AC2502112N          1831   Colorado               1
2            AC1200121          2080      Tulsa               1
3            222ADJUST             6    Memphis               1
4  AC1000148U-ORIG.REC          1235  Milwaukee               0

In [ ]:
dfVehiculoModerno=pd.read_sql("select * from VW_VehiculoModerno", conexion)
dfVehiculoModerno.head(5)